ProgessBase/Catalogs/НСИ_ФормыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>НСИ_ФормыДоговоров</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Типовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редакция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПродажи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НСИ_ТипПродажи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьСрокГодности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПРГ_ПроектыГП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТоварнаяКатегория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НСИ_ТоварныеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Брендообъем</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НСИ_Брендообъемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодностиОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодностиДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ProgessBase/Catalogs/НСИ_ФормыДоговоров/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Отказ Тогда
		Для каждого СтрокаПроверки Из Продукция Цикл
			Если Не ЗначениеЗаполнено(СтрокаПроверки.Проект) И Не ЗначениеЗаполнено(СтрокаПроверки.Брендообъем) И Не ЗначениеЗаполнено(СтрокаПроверки.ТоварнаяКатегория)
				И СтрокаПроверки.СрокГодностиДо = 0  И СтрокаПроверки.СрокГодностиОт = 0 Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Данные продукции содержат пустые строки", Отказ);	
			КонецЕсли;		
			
			Если Не СтрокаПроверки.СрокГодностиДо = 0 и СтрокаПроверки.СрокГодностиДо < СтрокаПроверки.СрокГодностиОт Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Не верно указаны сроки годности", Отказ);	
			КонецЕсли;		
		КонецЦикла; 
	КонецЕсли;	

КонецПроцедуры

Функция ЕстьСсылкиНаФормуДоговора() Экспорт
	
	Если ЭтоГруппа ИЛИ ЭтоНовый() Тогда
		Возврат Ложь;
	КонецЕсли;

	ЕстьСсылки = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 10
	               |	ДоговорыКонтрагентов.Ссылка КАК Договор,
	               |	ДоговорыКонтрагентов.Владелец КАК Контрагент
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.НСИ_ФормаДоговора = &Ссылка
	               |	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
		
	Пока Результат.Следующий() Цикл
		ЕстьСсылки = Истина;
		ОбщегоНазначения.Сообщение("Данная форма договора уже используется в договоре контрагента " + СокрЛП(Результат.Договор) + " у контрагента " + СокрЛП(Результат.Контрагент));			   
	КонецЦикла;
	
	Возврат ЕстьСсылки;
КонецФункции
